#一个仅自己可见的，记录生活，记录想法，同时也可以作为学习的工具，比如词典，计算器（？），成绩记录和分析（比如折线图啊啥的）
'''我的主页'''
import streamlit as st

page = st.sidebar.radio('我的首页',['我的兴趣推荐','我的图片处理工具','我的智慧词典','我的留言区'])
def page1():
    '''我的兴趣推荐'''
    st.write('欢迎来到我的兴趣分享，希望大家能在这里重拾力量。')
    st.write('-------------------------------------------------------------------')
    st.write('近期在看的电视剧')
    st.write('《烟火人家》')
    st.image('烟火人家.jpg')
    st.write('-------------------------------------------------------------------')
    st.write('近期在看的综艺')
    st.write('《令人心动的offer5》')
    st.image('令人心动的offer5.jpg')
    st.write('-------------------------------------------------------------------')
    st.write('最爱的电影')
    st.write('《魔法满屋》')
    st.image('魔法满屋.png')
    st.write('-------------------------------------------------------------------')
    st.write('最爱的小说')
    st.write('《拉普拉斯的魔女》')
    st.write('-------------------------------------------------------------------')
    st.write('喜欢的科目')
    st.write('语文、生物')
    st.write('-------------------------------------------------------------------')
    st.write('我的爱好')
    st.write('看书、追剧、学各种各样的技能')
    st.write('-------------------------------------------------------------------')
    st.write('看看我喜欢的一些小说语录，治愈一下自己吧！')
    st.image('语录1.jpg')
    st.write('「我们太急切想要一个答案了。想要风光的学位，瞬间的博学，想要意气风发，想闪着金光走向喜欢的人。但现实告诉我，操之过急便会败北，他要我等，要我耐得住不断延长的时间线，要我交付出足够的努力堆砌在沉闷、晦涩的时光里，才肯将一切“我想要”一点一点递送至我手里。」')
    st.image('语录2.jpg')
    st.write('[最勇敢的方式就是销声匿迹，自我沉淀，在繁华中自律，在落魄中自愈。那些难以言表、不作声响、暗自努力的日子，通往你想要的生活，所以开始了就不要停下。心若有所向往，何惧道阻且长。]')
    st.image('鼓励1.jpg')
    st.image('鼓励2.jpg')
    st.image('鼓励4.jpg')
    st.image('鼓励5.jpg')
    st.write('-------------------------------------------------------------------')
    st.write('向未来张望的时光，或许孤独而漫长，希望努力过后，都是晴朗。')
    st.image('pic2.png')
    st.write('注明：以上图片来源于网络。')
def page2():
    '''我的图片处理工具'''
    pass
def page3():
    '''我的智慧词典'''
    pass
def page4():
    '''我的留言区'''
    pass
    
if page == '我的兴趣推荐':
    page1()
if page == '我的图片处理工具':
    page2()
if page == '我的智慧词典':
    page3()
if page == '我的留言区':
    page4()
    